# --- Business Logic Errors ---
error.auth.invalidOtp=.\u06A9\u062F \u062A\u0627\u06CC\u06CC\u062F \u0646\u0627\u0645\u0639\u062A\u0628\u0631 \u0627\u0633\u062A
error.auth.expireOtp=\u06A9\u062F \u0634\u0645\u0627 \u0645\u0646\u0642\u0636\u06CC \u0634\u062F\u0647 \u0627\u0633\u062A. \u0644\u0637\u0641\u0627 \u0645\u062C\u062F\u062F\u0627 \u062A\u0644\u0627\u0634 \u0646\u0645\u0627\u06CC\u06CC\u062F
error.auth.token.invalid=\u062A\u0648\u06A9\u0646 \u0645\u0646\u0642\u0636\u06CC \u06CC\u0627 \u0646\u0627\u0645\u0639\u062A\u0628\u0631 \u0627\u0633\u062A. \u0644\u0637\u0641\u0627\u064B \u062F\u0648\u0628\u0627\u0631\u0647 \u0648\u0627\u0631\u062F \u0634\u0648\u06CC\u062F.
error.user.alreadyExists=\u06A9\u0627\u0631\u0628\u0631\u06CC \u0628\u0627 \u0627\u06CC\u0646 \u0634\u0645\u0627\u0631\u0647 \u0645\u0648\u0628\u0627\u06CC\u0644 \u0627\u0632 \u0642\u0628\u0644 \u0648\u062C\u0648\u062F \u062F\u0627\u0631\u062F.
error.user.nationalIdAlreadyExists=\u06A9\u0627\u0631\u0628\u0631\u06CC \u0628\u0627 \u0627\u06CC\u0646 \u0634\u0646\u0627\u0633\u0647 \u0645\u0644\u06CC \u0627\u0632 \u0642\u0628\u0644 \u0648\u062C\u0648\u062F \u062F\u0627\u0631\u062F.
error.auth.otp.cooldown=\u0644\u0637\u0641\u0627\u064B {0} \u062B\u0627\u0646\u06CC\u0647 \u0642\u0628\u0644 \u0627\u0632 \u062F\u0631\u062E\u0648\u0627\u0633\u062A \u06A9\u062F \u062C\u062F\u06CC\u062F \u0635\u0628\u0631 \u06A9\u0646\u06CC\u062F.

# --- Ingot & Transfer Errors ---
error.user.newMobileEqualOld= \u0634\u0645\u0627\u0631\u0647 \u0647\u0645\u0631\u0627\u0647 \u062C\u062F\u06CC\u062F \u0628\u0627 \u0642\u062F\u06CC\u0645\u06CC \u0646\u0645\u06CC \u062A\u0648\u0627\u0646\u062F \u06CC\u06A9\u0633\u0627\u0646 \u0628\u0627\u0634\u062F
error.ingot.notFound=\u0634\u0645\u0634 \u06CC\u0627\u0641\u062A \u0646\u0634\u062F.
error.ingot.alreadyExists=\u0634\u0645\u0634 \u0628\u0627 \u0633\u0631\u06CC\u0627\u0644 {0} \u062F\u0631\u062D\u0627\u0644 \u062D\u0627\u0636\u0631 \u0648\u062C\u0648\u062F \u062F\u0627\u0631\u062F
error.ingot.ownership=\u0634\u0645\u0627 \u0645\u0627\u0644\u06A9 \u0627\u06CC\u0646 \u0634\u0645\u0634 \u0646\u06CC\u0633\u062A\u06CC\u062F.
error.ingot.alreadyOwnership=\u062F\u0631 \u062D\u0627\u0644 \u062D\u0627\u0636\u0631 \u0646\u06CC\u0632 {0} \u0645\u0627\u0644\u06A9 \u0627\u06CC\u0646 \u0634\u0645\u0634 \u0645\u06CC \u0628\u0627\u0634\u062F
error.ingot.isStolen=\u0627\u06CC\u0646 \u0634\u0645\u0634 \u0628\u0647 \u0639\u0646\u0648\u0627\u0646 \u0633\u0631\u0642\u062A \u0634\u062F\u0647 \u06AF\u0632\u0627\u0631\u0634 \u0634\u062F\u0647 \u0627\u0633\u062A \u0648 \u0642\u0627\u0628\u0644 \u0627\u0646\u062A\u0642\u0627\u0644 \u0646\u06CC\u0633\u062A.
error.transfer.notFound=\u0627\u0646\u062A\u0642\u0627\u0644 \u06CC\u0627\u0641\u062A \u0646\u0634\u062F.
error.transfer.sellerMismatch=\u0634\u0645\u0627 \u0641\u0631\u0648\u0634\u0646\u062F\u0647 \u0627\u06CC\u0646 \u0627\u0646\u062A\u0642\u0627\u0644 \u0646\u06CC\u0633\u062A\u06CC\u062F.
error.transfer.invalidStatus=\u0648\u0636\u0639\u06CC\u062A \u0627\u0646\u062A\u0642\u0627\u0644 \u0646\u0627\u0645\u0639\u062A\u0628\u0631 \u0627\u0633\u062A.
error.transfer.invalidBuyer=\u0628\u0647 \u0627\u06CC\u0646 \u06A9\u0627\u0631\u0628\u0631 \u0646\u0645\u06CC \u062A\u0648\u0627\u0646 \u0634\u0645\u0634\u06CC \u0627\u0646\u062A\u0642\u0627\u0644 \u062F\u0627\u062F
error.transfer.permissionDenied=\u0634\u0645\u0627 \u0627\u062C\u0627\u0632\u0647 \u0627\u0646\u062C\u0627\u0645 \u0627\u06CC\u0646 \u0639\u0645\u0644\u06CC\u0627\u062A \u0631\u0627 \u0646\u062F\u0627\u0631\u06CC\u062F.
error.ingot.duplicateIssueReport=\u06AF\u0632\u0627\u0631\u0634 \u0628\u0631\u0627\u06CC \u0627\u06CC\u0646 \u0634\u0645\u0634 \u0642\u0628\u0644\u0627 \u062B\u0628\u062A \u0634\u062F\u0647 \u0627\u0633\u062A.
error.ingot.IssueReportNotFound=\u06AF\u0632\u0627\u0631\u0634 \u0633\u0631\u0642\u062A/\u0645\u0641\u0642\u0648\u062F\u06CC/\u0645\u062E\u062F\u0648\u0634\u06CC \u06CC\u0627\u0641\u062A \u0646\u0634\u062F.
error.theft.invalidIssueReport=\u0627\u0645\u06A9\u0627\u0646 \u062B\u0628\u062A \u06AF\u0632\u0627\u0631\u0634 \u0628\u0631\u0627\u06CC \u0627\u06CC\u0646 \u0634\u0645\u0634 \u0648\u062C\u0648\u062F \u0646\u062F\u0627\u0631\u062F

# --- Spring Framework & Web Layer Errors ---
error.validation.failed=\u0627\u0639\u062A\u0628\u0627\u0631\u0633\u0646\u062C\u06CC \u0628\u0631\u0627\u06CC \u06CC\u06A9 \u06CC\u0627 \u0686\u0646\u062F \u0641\u06CC\u0644\u062F \u0628\u0627 \u0634\u06A9\u0633\u062A \u0645\u0648\u0627\u062C\u0647 \u0634\u062F.
error.json.malformed=\u0628\u062F\u0646\u0647 \u062F\u0631\u062E\u0648\u0627\u0633\u062A \u06CC\u06A9 \u0634\u06CC\u0621 JSON \u0645\u0639\u062A\u0628\u0631 \u0646\u06CC\u0633\u062A.
error.request.missingParam=\u067E\u0627\u0631\u0627\u0645\u062A\u0631 \u0636\u0631\u0648\u0631\u06CC {0} \u062F\u0631 \u062F\u0631\u062E\u0648\u0627\u0633\u062A \u0648\u062C\u0648\u062F \u0646\u062F\u0627\u0631\u062F.
error.request.typeMismatch=\u067E\u0627\u0631\u0627\u0645\u062A\u0631 {0} \u0628\u0627\u06CC\u062F \u0627\u0632 \u0646\u0648\u0639 {1} \u0628\u0627\u0634\u062F.
error.request.methodNotAllowed=\u0645\u062A\u062F HTTP {0} \u0628\u0631\u0627\u06CC \u0627\u06CC\u0646 \u0645\u0646\u0628\u0639 \u067E\u0634\u062A\u06CC\u0628\u0627\u0646\u06CC \u0646\u0645\u06CC\u200C\u0634\u0648\u062F.
error.request.mediaTypeNotSupported=\u0646\u0648\u0639 \u0631\u0633\u0627\u0646\u0647 (media type) {0} \u067E\u0634\u062A\u06CC\u0628\u0627\u0646\u06CC \u0646\u0645\u06CC\u200C\u0634\u0648\u062F.
error.request.notFound=\u0645\u0646\u0628\u0639 \u062F\u0631\u062E\u0648\u0627\u0633\u062A\u06CC \u062F\u0631 \u0622\u062F\u0631\u0633 {0} \u06CC\u0627\u0641\u062A \u0646\u0634\u062F.
error.request.payloadTooLarge=\u062D\u062C\u0645 \u062F\u0631\u062E\u0648\u0627\u0633\u062A \u0627\u0632 \u062D\u062F\u0627\u06A9\u062B\u0631 \u0627\u0646\u062F\u0627\u0632\u0647 \u0645\u062C\u0627\u0632 \u0628\u06CC\u0634\u062A\u0631 \u0627\u0633\u062A.

# --- Generic & Fallback Errors ---
error.server.internal=\u06CC\u06A9 \u062E\u0637\u0627\u06CC \u062F\u0627\u062E\u0644\u06CC \u067E\u06CC\u0634\u200C\u0628\u06CC\u0646\u06CC \u0646\u0634\u062F\u0647 \u0631\u062E \u062F\u0627\u062F\u0647 \u0627\u0633\u062A. \u0644\u0637\u0641\u0627\u064B \u0628\u0627 \u067E\u0634\u062A\u06CC\u0628\u0627\u0646\u06CC \u062A\u0645\u0627\u0633 \u0628\u06AF\u06CC\u0631\u06CC\u062F.
error.user.notFound=\u06A9\u0627\u0631\u0628\u0631 \u06CC\u0627\u0641\u062A \u0646\u0634\u062F.

error.user.invalidMatchNationalMobile=\u06A9\u062F\u0645\u0644\u06CC \u0628\u0627 \u0634\u0645\u0627\u0631\u0647 \u0647\u0645\u0631\u0627\u0647 \u062A\u0637\u0627\u0628\u0642 \u0646\u062F\u0627\u0631\u062F

transfer.success=\u06A9\u0627\u0631\u0628\u0631 \u0645\u062D\u062A\u0631\u0645\n\u060C \u0634\u0645\u0634 \u0634\u0645\u0627\u0631\u0647 {0} \u0628\u0627 \u0645\u0648\u0641\u0642\u06CC\u062A \u0628\u0647 \u0634\u0645\u0627 \u0627\u0646\u062A\u0642\u0627\u0644 \u062F\u0627\u062F\u0647 \u0634\u062F. \u062C\u0647\u062A \u0645\u0634\u0627\u0647\u062F\u0647 \u0627\u0637\u0644\u0627\u0639\u0627\u062A \u06A9\u0627\u0645\u0644\u060C \u0628\u0647 \u0633\u0627\u0645\u0627\u0646\u0647 \u0632\u0631\u0646\u0627\u0628 \u0645\u0631\u0627\u062C\u0639\u0647 \u0641\u0631\u0645\u0627\u06CC\u06CC\u062F.