# Farsi (Persian) Messages

# --- General ---
error.server.internal=\u06CC\u06A9 \u062E\u0637\u0627\u06CC \u062F\u0627\u062E\u0644\u06CC \u063A\u06CC\u0631\u0645\u0646\u062A\u0638\u0631\u0647 \u062F\u0631 \u0633\u0631\u0648\u0631 \u0631\u062E \u062F\u0627\u062F\u0647 \u0627\u0633\u062A.
error.validation.failed=\u0627\u0639\u062A\u0628\u0627\u0631\u0633\u0646\u062C\u06CC \u062F\u0631\u062E\u0648\u0627\u0633\u062A \u0646\u0627\u0645\u0648\u0641\u0642 \u0628\u0648\u062F.
error.json.malformed=\u0633\u0627\u062E\u062A\u0627\u0631 JSON \u0627\u0631\u0633\u0627\u0644 \u0634\u062F\u0647 \u0646\u0627\u062F\u0631\u0633\u062A \u0627\u0633\u062A.
error.request.missingParam=\u06CC\u06A9\u06CC \u0627\u0632 \u067E\u0627\u0631\u0627\u0645\u062A\u0631\u0647\u0627\u06CC \u0627\u0644\u0632\u0627\u0645\u06CC \u062F\u0631\u062E\u0648\u0627\u0633\u062A \u0627\u0631\u0633\u0627\u0644 \u0646\u0634\u062F\u0647 \u0627\u0633\u062A.
error.request.typeMismatch=\u0646\u0648\u0639 \u06CC\u06A9\u06CC \u0627\u0632 \u067E\u0627\u0631\u0627\u0645\u062A\u0631\u0647\u0627\u06CC \u062F\u0631\u062E\u0648\u0627\u0633\u062A \u0646\u0627\u062F\u0631\u0633\u062A \u0627\u0633\u062A.
error.request.methodNotAllowed=\u0627\u06CC\u0646 \u0646\u0642\u0637\u0647 \u067E\u0627\u06CC\u0627\u0646\u06CC \u0627\u0632 \u0645\u062A\u062F HTTP \u062F\u0631\u062E\u0648\u0627\u0633\u062A\u06CC \u067E\u0634\u062A\u06CC\u0628\u0627\u0646\u06CC \u0646\u0645\u06CC\u200C\u06A9\u0646\u062F.
error.request.mediaTypeNotSupported=\u0646\u0648\u0639 \u0631\u0633\u0627\u0646\u0647 \u0627\u0631\u0633\u0627\u0644 \u0634\u062F\u0647 \u067E\u0634\u062A\u06CC\u0628\u0627\u0646\u06CC \u0646\u0645\u06CC\u200C\u0634\u0648\u062F.
error.request.notFound=\u0645\u0646\u0628\u0639 \u062F\u0631\u062E\u0648\u0627\u0633\u062A\u06CC \u06CC\u0627\u0641\u062A \u0646\u0634\u062F.
error.request.payloadTooLarge=\u062D\u062C\u0645 \u062F\u0631\u062E\u0648\u0627\u0633\u062A \u0628\u0632\u0631\u06AF\u062A\u0631 \u0627\u0632 \u062D\u062F \u0645\u062C\u0627\u0632 \u0627\u0633\u062A.

# --- Authentication & User Management ---
error.auth.invalidOtp=\u06A9\u062F \u062A\u0627\u06CC\u06CC\u062F \u06CC\u06A9\u0628\u0627\u0631 \u0645\u0635\u0631\u0641 \u0648\u0627\u0631\u062F \u0634\u062F\u0647 \u0646\u0627\u0645\u0639\u062A\u0628\u0631 \u0627\u0633\u062A.
error.auth.expireOtp=\u06A9\u062F \u062A\u0627\u06CC\u06CC\u062F \u06CC\u06A9\u0628\u0627\u0631 \u0645\u0635\u0631\u0641 \u0648\u0627\u0631\u062F \u0634\u062F\u0647 \u0645\u0646\u0642\u0636\u06CC \u0634\u062F\u0647 \u0627\u0633\u062A.
error.auth.token.invalid=\u062A\u0648\u06A9\u0646 \u0627\u062D\u0631\u0627\u0632 \u0647\u0648\u06CC\u062A \u0645\u0646\u0642\u0636\u06CC \u06CC\u0627 \u0646\u0627\u0645\u0639\u062A\u0628\u0631 \u0627\u0633\u062A. \u0644\u0637\u0641\u0627\u064B \u062F\u0648\u0628\u0627\u0631\u0647 \u0648\u0627\u0631\u062F \u0634\u0648\u06CC\u062F.
error.user.alreadyExists=\u06A9\u0627\u0631\u0628\u0631\u06CC \u0628\u0627 \u0627\u06CC\u0646 \u0634\u0645\u0627\u0631\u0647 \u0645\u0648\u0628\u0627\u06CC\u0644 \u0642\u0628\u0644\u0627\u064B \u062B\u0628\u062A\u200C\u0646\u0627\u0645 \u06A9\u0631\u062F\u0647 \u0627\u0633\u062A.
error.user.nationalIdAlreadyExists=\u06A9\u0627\u0631\u0628\u0631\u06CC \u0628\u0627 \u0627\u06CC\u0646 \u06A9\u062F \u0645\u0644\u06CC \u0642\u0628\u0644\u0627\u064B \u062B\u0628\u062A\u200C\u0646\u0627\u0645 \u06A9\u0631\u062F\u0647 \u0627\u0633\u062A.
error.user.notFound=\u06A9\u0627\u0631\u0628\u0631 \u06CC\u0627\u0641\u062A \u0646\u0634\u062F.
error.auth.otp.cooldown=\u0634\u0645\u0627 \u0628\u0647 \u062A\u0627\u0632\u06AF\u06CC \u06CC\u06A9 \u06A9\u062F \u062A\u0627\u06CC\u06CC\u062F \u062F\u0631\u062E\u0648\u0627\u0633\u062A \u06A9\u0631\u062F\u0647\u200C\u0627\u06CC\u062F. \u0644\u0637\u0641\u0627\u064B \u06A9\u0645\u06CC \u0635\u0628\u0631 \u06A9\u0646\u06CC\u062F.
error.user.newMobileEqualOld=\u0634\u0645\u0627\u0631\u0647 \u0645\u0648\u0628\u0627\u06CC\u0644 \u062C\u062F\u06CC\u062F \u0646\u0645\u06CC\u200C\u062A\u0648\u0627\u0646\u062F \u0628\u0627 \u0634\u0645\u0627\u0631\u0647 \u0642\u0628\u0644\u06CC \u06CC\u06A9\u0633\u0627\u0646 \u0628\u0627\u0634\u062F.
error.user.invalidMatchNationalMobile=\u06A9\u062F \u0645\u0644\u06CC \u0648 \u0634\u0645\u0627\u0631\u0647 \u0645\u0648\u0628\u0627\u06CC\u0644 \u0648\u0627\u0631\u062F \u0634\u062F\u0647 \u0628\u0627 \u06CC\u06A9\u062F\u06CC\u06AF\u0631 \u0645\u0637\u0627\u0628\u0642\u062A \u0646\u062F\u0627\u0631\u0646\u062F.

# --- Ingot & Transfer Management ---
error.ingot.notFound=\u0634\u0645\u0634 \u06CC\u0627\u0641\u062A \u0646\u0634\u062F.
error.ingot.alreadyExists=\u0634\u0645\u0634\u06CC \u0628\u0627 \u0627\u06CC\u0646 \u0634\u0645\u0627\u0631\u0647 \u0633\u0631\u06CC\u0627\u0644 \u0642\u0628\u0644\u0627\u064B \u062B\u0628\u062A \u0634\u062F\u0647 \u0627\u0633\u062A.
error.ingot.ownership=\u0634\u0645\u0627 \u0627\u062C\u0627\u0632\u0647 \u0627\u0646\u062C\u0627\u0645 \u0627\u06CC\u0646 \u0639\u0645\u0644\u06CC\u0627\u062A \u0631\u0627 \u0631\u0648\u06CC \u0634\u0645\u0634 \u0645\u0648\u0631\u062F \u0646\u0638\u0631 \u0646\u062F\u0627\u0631\u06CC\u062F.
error.ingot.alreadyOwnership=\u0627\u06CC\u0646 \u0634\u0645\u0634 \u062F\u0631 \u062D\u0627\u0644 \u062D\u0627\u0636\u0631 \u0628\u0647 \u0645\u0627\u0644\u06A9 \u0645\u0634\u062E\u0635 \u0634\u062F\u0647 \u062A\u0639\u0644\u0642 \u062F\u0627\u0631\u062F.
error.ingot.isStolen=\u0628\u0647 \u062F\u0644\u06CC\u0644 \u06AF\u0632\u0627\u0631\u0634 \u0633\u0631\u0642\u062A \u06CC\u0627 \u0645\u0641\u0642\u0648\u062F\u06CC\u060C \u0627\u0646\u062C\u0627\u0645 \u0627\u06CC\u0646 \u0639\u0645\u0644\u06CC\u0627\u062A \u0631\u0648\u06CC \u0634\u0645\u0634 \u0627\u0645\u06A9\u0627\u0646\u200C\u067E\u0630\u06CC\u0631 \u0646\u06CC\u0633\u062A.
error.transfer.notFound=\u0631\u06A9\u0648\u0631\u062F \u0627\u0646\u062A\u0642\u0627\u0644 \u06CC\u0627\u0641\u062A \u0646\u0634\u062F.
error.transfer.sellerMismatch=\u0634\u0645\u0627 \u0641\u0631\u0648\u0634\u0646\u062F\u0647 \u0627\u06CC\u0646 \u0627\u0646\u062A\u0642\u0627\u0644 \u0646\u06CC\u0633\u062A\u06CC\u062F.
error.transfer.invalidStatus=\u0648\u0636\u0639\u06CC\u062A \u0641\u0639\u0644\u06CC \u0627\u0646\u062A\u0642\u0627\u0644 \u0628\u0631\u0627\u06CC \u0627\u0646\u062C\u0627\u0645 \u0627\u06CC\u0646 \u0639\u0645\u0644\u06CC\u0627\u062A \u0645\u062C\u0627\u0632 \u0646\u06CC\u0633\u062A.
error.transfer.permissionDenied=\u0634\u0645\u0627 \u0627\u062C\u0627\u0632\u0647 \u0644\u063A\u0648 \u0627\u06CC\u0646 \u0627\u0646\u062A\u0642\u0627\u0644 \u0631\u0627 \u0646\u062F\u0627\u0631\u06CC\u062F.
error.ingot.duplicateIssueReport=\u06CC\u06A9 \u06AF\u0632\u0627\u0631\u0634 \u0645\u0634\u06A9\u0644 \u0628\u0627\u0632 \u0628\u0631\u0627\u06CC \u0627\u06CC\u0646 \u0634\u0645\u0634 \u062F\u0631 \u062D\u0627\u0644 \u062D\u0627\u0636\u0631 \u0648\u062C\u0648\u062F \u062F\u0627\u0631\u062F.
error.ingot.IssueReportNotFound=\u06AF\u0632\u0627\u0631\u0634 \u0645\u0634\u06A9\u0644 \u06CC\u0627\u0641\u062A \u0646\u0634\u062F.
error.theft.invalidIssueReport=\u0648\u0636\u0639\u06CC\u062A \u0641\u0639\u0644\u06CC \u06AF\u0632\u0627\u0631\u0634 \u0645\u0634\u06A9\u0644 \u0628\u0631\u0627\u06CC \u0627\u0646\u062C\u0627\u0645 \u0627\u06CC\u0646 \u0639\u0645\u0644\u06CC\u0627\u062A \u0645\u062C\u0627\u0632 \u0646\u06CC\u0633\u062A.
error.transfer.invalidBuyer=\u062E\u0631\u06CC\u062F\u0627\u0631 \u0645\u0634\u062E\u0635 \u0634\u062F\u0647 \u0628\u0631\u0627\u06CC \u0627\u06CC\u0646 \u0627\u0646\u062A\u0642\u0627\u0644 \u0645\u0639\u062A\u0628\u0631 \u0646\u06CC\u0633\u062A.

# --- Inheritance Flow ---
error.inheritance.caseAlreadyExists=\u06CC\u06A9 \u067E\u0631\u0648\u0646\u062F\u0647 \u0627\u0646\u062D\u0635\u0627\u0631 \u0648\u0631\u0627\u062B\u062A \u0628\u0631\u0627\u06CC \u06A9\u0627\u0631\u0628\u0631 \u0645\u062A\u0648\u0641\u06CC \u062F\u0631 \u062D\u0627\u0644 \u062D\u0627\u0636\u0631 \u0648\u062C\u0648\u062F \u062F\u0627\u0631\u062F.
error.inheritance.caseNotFound=\u067E\u0631\u0648\u0646\u062F\u0647 \u0627\u0646\u062D\u0635\u0627\u0631 \u0648\u0631\u0627\u062B\u062A \u0645\u0648\u0631\u062F \u0646\u0638\u0631 \u06CC\u0627\u0641\u062A \u0646\u0634\u062F.
error.inheritance.invalidCaseStatus=\u0627\u06CC\u0646 \u0639\u0645\u0644\u06CC\u0627\u062A \u0628\u0631\u0627\u06CC \u0648\u0636\u0639\u06CC\u062A \u0641\u0639\u0644\u06CC \u067E\u0631\u0648\u0646\u062F\u0647 \u0645\u062C\u0627\u0632 \u0646\u06CC\u0633\u062A.
error.inheritance.heirNotFound=\u0648\u0627\u0631\u062B \u0645\u0634\u062E\u0635 \u0634\u062F\u0647 \u062F\u0631 \u0627\u06CC\u0646 \u067E\u0631\u0648\u0646\u062F\u0647 \u0627\u0646\u062D\u0635\u0627\u0631 \u0648\u0631\u0627\u062B\u062A \u06CC\u0627\u0641\u062A \u0646\u0634\u062F.

# --- SMS Service ---
inheritance.initiate.success=\u067E\u0631\u0648\u0646\u062F\u0647 \u0627\u0646\u062D\u0635\u0627\u0631 \u0648\u0631\u0627\u062B\u062A \u0634\u0645\u0627 \u0628\u0627 \u0645\u0648\u0641\u0642\u06CC\u062A \u0622\u063A\u0627\u0632 \u0634\u062F. \u06A9\u062F \u0631\u0647\u06AF\u06CC\u0631\u06CC: {0}
